In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
#ditambahin variabel data1 karena penulis lupa untuk mengubah variabel dari objek eksperimen
data1 = Series(['one','two',np.nan,'four'])

In [3]:
data1

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
#untuk mengetahui index mana yang memiliki null value
data1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
#dropna dilakukan untuk menghapus value yang isinya adalah null
data1.dropna()

0     one
1     two
3    four
dtype: object

In [6]:
#data.dropna tidak disimpan di dalam data
#ada beberapa method yang disimpan ada beberapa method yang tidak disimpan
data1

0     one
1     two
2     NaN
3    four
dtype: object

In [7]:
#melakukan fillna dalam Series, ini merupakan lanjutan dari sel bawah dari DataFrame  
#ternyata berhasill juga
data1.fillna(0)

0     one
1     two
2       0
3    four
dtype: object

In [8]:
#menghapus null dengan menggunakan inplace untuk Series 
#sel ini merupakan sel lanjutan dari sel bawah tentang inplace di DataFrame, penulis ingin tahu apakah inplace juga berlaku di Series
data.dropna(inplace=True)
#ternyata inplace juga berpengaruh di dalam Series 
data

NameError: name 'data' is not defined

In [9]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [10]:
clean_dframe = dframe.dropna()
#hanya akan mendapat baris pertama karena cuma index 0 yang tidak ada nilai null nya 
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [11]:
#menghapus baris yang semua barisnya adalah null
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [12]:
#tetap tidak terganti
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [13]:
#menghapus kolom yang ada null nya
'''
INGAT: axis = 0, all row in each columns 
axis = 1, all column in each rows
'''
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [14]:
#tidak perlu memakai tanda kurung karena cuma menampilkan null doang dan tanpa parameter (?)
#.nan digunakan untuk special value? digunakan untuk memanggil objek
#pengetahuan mengenai .nan dan .nan() diluar dari materi ini, tapi patut untuk digali di kemudian hari 
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn], [2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [15]:
#baris yang cuma memiliki dua data point, jadi baris yang valuenya keisi kurang dari dua akan dihapus 
#namanya adalah thresholf
dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [16]:
#memiliki at least three data point
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [17]:
#mengisi null value yang ada dengan nilai 1 
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [18]:
#mengisi tiap baris, isi value Na yang beda
#dilihatnya per kolom, ingat: axis=0 all rows in each kolom
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [19]:
#tidak bisa, karena cuma bisa mengisinya kolom per kolom doang alias cuma isi di bagian kolom
dframe2.fillna({0:0,1:1,2:2,3:3}, axis=1)

NotImplementedError: Currently only can fill with dict/Series column by column

In [20]:
#walaupun kita sudah memodifikasi dataframe tersebut, akan tetapi tetap tidak akan berubah di dalam drame2
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [21]:
#bagaimana caranya untuk merubah? 
#ada dua cara, pertama adalah didefinisikan: 

#dframe2 = dframe2.fillna(....)

#kedua adalah dengan menggunakan method inplace
dframe2.fillna(0, inplace=True)
#perubahan tersimpan ke dalam dframe2
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

## Index Hierarchy

In [22]:
from numpy.random import randn

In [23]:
ser = Series(randn(6), index=[[1,1,1,2,2,2], ['a','b','c','a','b','c']])
#membuat multiple index level
#jadi value 1 ada tiga value lagi
#levelling dari index
ser

1  a    0.796954
   b   -1.382488
   c    0.887319
2  a    0.290029
   b   -1.171931
   c   -0.362071
dtype: float64

In [24]:
#melihat index dengan diberitahukan levelnya
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [25]:
ser[1]

a    0.796954
b   -1.382488
c    0.887319
dtype: float64

In [26]:
ser[2]

a    0.290029
b   -1.171931
c   -0.362071
dtype: float64

In [27]:
#memanggil secara spesifik
ser[1]['a']

0.7969541119796666

In [28]:
ser[:]['a']

KeyError: 'a'

In [29]:
#mau melihat nilai a dari semua index yang ada
ser[:,'a']

1    0.796954
2    0.290029
dtype: float64

In [30]:
#create DataFrame from a series of multiple level
dframe = ser.unstack()

In [31]:
#index yang memiliki level lebih tinggi yang menjadi index baris
dframe

          a         b         c
1  0.796954 -1.382488  0.887319
2  0.290029 -1.171931 -0.362071

In [33]:
dframe2 = DataFrame(np.arange(16).reshape(4,4), index=[['a','a','b','b'], [1,2,1,2]],
                    #notice bahwa tiap index berpasangan dengan index setelahnya 
                    #misal: 'NY' pertama pasti berpasangan dengan 'cold', 'NY' kedua dengan 'hot', dst
                    #oleh karena itulah mengapa 'LA' dan 'SF' cuma memiliki satu pasangan 
                    columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [37]:
#ada beberapa method yang tidak bisa pakai tanda kurung
dframe2.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [38]:
dframe2.columns

MultiIndex(levels=[['LA', 'NY', 'SF'], ['cold', 'hot']],
           codes=[[1, 1, 0, 2], [0, 1, 1, 0]])

In [40]:
#memberikan nama ke tiap baris dan kolom
dframe2.index.names = ['INDEX_1', 'INDEX_2']
dframe2.columns.names = ['Cities', 'Temp']

In [41]:
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [43]:
#mengganti level
#harus menggunakan axis karena level 
dframe2.swaplevel('Cities','Temp', axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [45]:
dframe3 = dframe2.copy()

In [46]:
dframe3

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [47]:
#tidak memiliki parameter 'inplace', berarti dengan menggunakan cara pendefinisian biasa
dframe3.swaplevel('Cities','Temp', axis=1, inplace=True)

TypeError: swaplevel() got an unexpected keyword argument 'inplace'

In [49]:
#melakukan sorting dari level yang pertama
#level dimulai dari level 0
#berarti level 1 adalah baris dengan index 1 dan 2
dframe2.sort_index(level=1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [51]:
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [50]:
#menghitung semua temperature yang cold dan hot dari setiap baris
#lebih simpel: axis=0 merupakan baris, axis=1 merupakan kolom 
dframe2.sum(level='Temp', axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27